In [1]:
import pandas as pd
from IPython.display import HTML, display
import pandas_practice as pp
import importlib
import numpy as np

In [2]:
importlib.reload(pp)

### Install lxml

For one of the practice problems, you will need to install lxml

In [3]:
#!conda install lxml -y

## Problem 1: Reading in a compressed data File

`yob1883.txt.gz` and `yob1983.txt.gz` are files containing the names for male and female babies born in 1883 and 1983 respectively (down to names occuring at least 5 times each year). They are compressed with the Gnuzip  (gzip) algorithm. Can you read these files directly into a Pandas DataFrame via Pandas (that is, without first uncompressing the files)?

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
      <th>2</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Mary</td>
      <td>F</td>
      <td>8012</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Anna</td>
      <td>F</td>
      <td>3306</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Emma</td>
      <td>F</td>
      <td>2367</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Elizabeth</td>
      <td>F</td>
      <td>2255</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Minnie</td>
      <td>F</td>
      <td>2035</td>
    </tr>
  </tbody>
</table>

## Problem 2: Reading in Parts of Files

* For 1883 the female names end on line 1054
* For 1983 the female names end on line 12065


### Read in just the rows with female names and separately just the rows with male names

* Use the `head()` and `tail()` methods to check your results
* For 1883
    * Mary is the first female name and Zoa is the last female name
    * John is the first male name and Winthrop is the last male name
* For 1983 
    * Jennifer is the first female name and Zulaika is the last female name
    * Michael is the first male name and Zoran is the last male name

In [5]:

yob1883_female, yob1883_male, yob1983_female, yob1983_male = \
    pp.problem2()
display(HTML("<h2>1983 Female Head</h2>"))
display(yob1983_female.head())
display(HTML("<h2>1983 Female Tail</h2>"))

display(yob1983_female.tail())
display(HTML("<h2>1983 Male Head</h2>"))

display(yob1983_male.head())
display(HTML("<h2>1983 Male Tail</h2>"))

display(yob1983_male.tail())

          0  1      2
0  Jennifer  F  54339
1   Jessica  F  45281
2    Amanda  F  33754
3    Ashley  F  33290
4     Sarah  F  27231

              0  1  2
12059      Zita  F  5
12060    Zondra  F  5
12061      Zoua  F  5
12062  Zshakira  F  5
12063   Zulaika  F  5

             0  1      2
0      Michael  M  67993
1  Christopher  M  59339
2      Matthew  M  50207
3        David  M  39199
4       Joshua  M  36705

             0  1  2
7333  Zebediah  M  5
7334   Zebulan  M  5
7335       Zef  M  5
7336     Zenas  M  5
7337     Zoran  M  5

In [6]:
display(HTML("<h2>1883 Female Head</h2>"))
display(yob1883_female.head())
display(HTML("<h2>1883 Female Tail</h2>"))

display(yob1883_female.tail())
display(HTML("<h2>1883 Male Head</h2>"))

display(yob1883_male.head())
display(HTML("<h2>1883 Male Tail</h2>"))

display(yob1883_male.tail())

           0  1     2
0       Mary  F  8012
1       Anna  F  3306
2       Emma  F  2367
3  Elizabeth  F  2255
4     Minnie  F  2035

            0  1  2
1049     Will  F  5
1050    Zelia  F  5
1051  Zenobia  F  5
1052   Zillah  F  5
1053      Zoa  F  5

         0  1     2
0     John  M  8894
1  William  M  8387
2    James  M  5223
3  Charles  M  4826
4   George  M  4736

             0  1  2
1025     Titus  M  5
1026     Toney  M  5
1027     Verna  M  5
1028    Winnie  M  5
1029  Winthrop  M  5

## Problem 3:

What is the count of male (female) names that occurred both in 1883 and 1983? What proportion of male (female) names does that count represent?

In [7]:
pp.problem3(yob1883_male, yob1983_male)

(854, 0.113654511578387)

In [8]:
pp.problem3(yob1883_female, yob1983_female)

(767, 0.062100234798801716)

## Problem 4

Are names shared between the sexes more common in 1983 or 1883?

In [9]:
pp.problem3(yob1883_male, yob1883_female)

(122, 0.06218144750254842)

In [10]:
pp.problem3(yob1983_male, yob1983_female)

(1736, 0.09826785916449678)

## Problem 5

Did your name occur in 1883, 1983?

In [11]:
pp.problem5("Brian", yob1883_male)

False

In [12]:
pp.problem5("Brian", yob1983_male)

True

## Selecting Data

We can select parts of a DataFrame by creating a boolean array of values and keeping only those elements with a True value. To illustrate this, I'm going to first create a DataFrame from a random selection.

In [14]:
names = pp.problem1("yob1983.txt.gz")
random_names = names.sample(n=1000)
print(random_names.shape)
random_names.head()

(1000, 3)

              0  1    2
12847    Antony  M  124
3347   Carlisha  F   24
17742    Duvall  M    6
7848    Renatta  F    8
3618      Laney  F   22

I can use the `apply` method to ask a question

In [15]:
(random_names[0].apply( lambda x: "K" in x)).head(10)

12847    False
3347     False
17742    False
7848     False
3618     False
11954    False
4127     False
19105    False
1998     False
7387     False
Name: 0, dtype: bool

In [16]:
random_names[random_names[0].apply( lambda x: "K" in x)].head(10)

              0  1     2
203    Kristine  F  1259
17940    Keanon  M     6
264      Kelley  F   908
648     Karissa  F   266
18857    Kenric  M     5
734      Karrie  F   223
944       Keely  F   157
7605    Karlina  F     8
12473    Kurtis  M   393
1591     Keesha  F    70

Or just ask questions about the column

In [17]:
(random_names[2] > 300).head(10)

12847    False
3347     False
17742    False
7848     False
3618     False
11954    False
4127     False
19105    False
1998     False
7387     False
Name: 2, dtype: bool

In [18]:
random_names[random_names[2] > 300].head(10)

               0  1     2
32         Erica  F  9709
12234      Wayne  M  1530
12401       Fred  M   547
12540  Salvatore  M   312
476         Dena  F   417
512        Nadia  F   373
203     Kristine  F  1259
588        Lacie  F   303
264       Kelley  F   908
490        Betsy  F   400

We can combine the questions with a element wise AND operator `&`

In [19]:
((random_names[0].apply( lambda x: "K" in x)) & (random_names[2] > 300)).head()

12847    False
3347     False
17742    False
7848     False
3618     False
dtype: bool

In [20]:
random_names[((random_names[0].apply( lambda x: "K" in x)) & (random_names[2] > 300))]

              0  1     2
203    Kristine  F  1259
264      Kelley  F   908
12473    Kurtis  M   393
253       Karla  F   939
489         Kim  F   401
399     Kristal  F   544
12483     Kerry  M   383

## Problem 6
Use boolean selection to create separate DataFrames of male and female names from `names`, a DataFrame containing all the male and female names.

In [21]:
female_names, male_names = pp.problem6("yob1983.txt.gz")

In [22]:
display(HTML("<h3>Female 1983</h3>"))
display(female_names.head(10))
display(HTML("<h3>Male 1983</h3>"))
display(male_names.head(10))

           0  1      2
0   Jennifer  F  54339
1    Jessica  F  45281
2     Amanda  F  33754
3     Ashley  F  33290
4      Sarah  F  27231
5    Melissa  F  23473
6     Nicole  F  22396
7  Stephanie  F  22325
8    Heather  F  20747
9  Elizabeth  F  19840

                 0  1      2
12064      Michael  M  67993
12065  Christopher  M  59339
12066      Matthew  M  50207
12067        David  M  39199
12068       Joshua  M  36705
12069        James  M  36348
12070        Jason  M  35109
12071       Daniel  M  34747
12072         John  M  33151
12073       Robert  M  32745

## Filtering with `isin`

I can ask questions about a column with the `isin` method

In [23]:
names[names[0].isin(["Brian", "Bryan", "Briana", "Brianna"])]

             0  1      2
242    Brianna  F    971
333     Briana  F    688
945      Brian  F    156
1609     Bryan  F     69
12077    Brian  M  26064
12110    Bryan  M   8190

## Problem 7

Create a DataFrame with all the rows that have names that occur for both females and males.

In [25]:
mf_names = pp.problem7("yob1983.txt.gz")
mf_names.sample(frac=1).sort([0,2]).head(20)

/opt/conda/lib/python3.5/site-packages/ipykernel_launcher.py:2: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)

             0  1      2
10269    Aaren  F      5
16967    Aaren  M      7
17545    Aarin  M      6
6698     Aarin  F      9
880      Aaron  F    172
12092    Aaron  M  14458
18294     Abby  M      5
199       Abby  F   1310
6700      Abel  F      9
12454     Abel  M    426
15469  Abigail  M     12
150    Abigail  F   1910
6702   Abraham  F      9
12332  Abraham  M    770
17546    Adair  M      6
7307     Adair  F      8
1047      Adam  F    132
12081     Adam  M  23485
18302     Addy  M      5
10277     Addy  F      5

## Problem 8
Use Pandas to read in a DataFrame from the "top100-icd9.html" file

In [30]:
pp.problem8("top100-icd9.html").head(20)

,Unnamed: 0,0,1,2,3,4
0,0,I. Infectious & Parasitic Diseases,None,Yes,034.0,Strep throat
1,1,I. Infectious & Parasitic Diseases,None,Yes,079.99,"Viral infection, unspec."
2,10,"III. Endocrine, Nutritional & Metabolic Disorders",None,Yes,278.02,Overweight
3,11,IV. Blood Diseases,None,Yes,280.9,"Anemia, iron deficiency, unspec."
4,12,IV. Blood Diseases,None,Yes,285.9,"Anemia, other, unspec."
5,13,V. Mental Disorders,None,Yes,300.00,"Anxiety state, unspec."
6,14,V. Mental Disorders,None,Yes,314.01,"Attention deficit, w/ hyperactivity"
7,15,V. Mental Disorders,None,Yes,311,"Depressive disorder, NOS"
8,16,V. Mental Disorders,None,Yes,307.40,"Insomnia, sleep disorder, unspec."
9,17,V. Mental Disorders,None,Yes,305.1,Tobacco abuse
10,18,VI. Nervous System & Sense Organ Disorders,Ear Diseases,Yes,380.4,Cerumen impaction
11,19,VI. Nervous System & Sense Organ Disorders,Ear Diseases,Yes,380.10,"Otitis externa, unspec."
12,2,I. Infectious & Parasitic Diseases,None,Yes,078.10,"Warts, viral, unspec."
13,20,VI. Nervous System & Sense Organ Disorders,Ear Diseases,Yes,382.00,"Otitis media, acute"
14,21,VI. Nervous System & Sense Organ Disorders,Eye Diseases,Yes,372.30,"Conjunctivitis, unspec."
15,22,VI. Nervous System & Sense Organ Disorders,Nervous System Diseases,Yes,434.91,"Cerebral artery occlusion w/ infarction, unspec."
16,23,VI. Nervous System & Sense Organ Disorders,Nervous System Diseases,Yes,345.90,"Epilepsy, unspec., not intractable"
17,24,VI. Nervous System & Sense Organ Disorders,Nervous System Diseases,Yes,346.90,"Migraine, unspec., not intractable"
18,25,VII. Circulatory System,None,Yes,427.31,Atrial fibrillation
19,26,VII. Circulatory System,None,Yes,414.9,"Chronic ischemic heart disease, unspec."